Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/annual_leave_public_holidays.html.txt.tmx
Source language: en
Languages: ga

source: Your entitlement to annual leave or holidays from work is set out in legislation and in your contract of employment
ga: Tá do theidlíocht maidir le saoire bhliantúil nó saoire ó fhostaíocht leaghta síos sa reachtaíocht agus sa chonradh fostaíochta

source: Legislation gives various entitlements to leave from work
ga: Tugann reachtaíocht cearta éagsúla saoire ón obair

source: These include annual leave, public holidays, maternity leave, paternity leave, adoptive leave, carer's leave, parental leave and other types of leave from work
ga: Ina measc siúd tá saoire bhliantúil, saoire laethanta poiblí, saoire mháithreachais, saoire atharthachta, saoire uchtaíoch, saoire chúramóra, saoire thuismitheoirí and saoire eile ó fhostaíocht

source: It is also important to note that the periods of leave provided for by legislation are the minimum entitlements only, you and your employer may agree to additional entitlements
ga: Ní mór a thabhairt faoi deara nach bhforálann an reachtaíocht ach do bhunchearta amháin maidir leis na tréimhsí saoire, is féidir leat agus le d'fhostóir teacht ar shocrú le cearta breise

source: In the case of agency employees, the party who pays the wages (employment agency or client company) is the employer for the purposes of the Act and is responsible for providing the entitlement
ga: I gcás oibrithe gníomhaireachta, faoin Acht seo is é an fostóir a íocann an tuarastal (gníomhaireacht fhostaíochta nó comhlacht custaiméara) agus is eisean atá freagrach as an ceart a sholáthar

source: The Organisation of Working Time Act 1997 provides for a basic annual paid leave entitlement of 4 weeks, although an employee's contract could give greater rights
ga: Déanann an tAcht um Eagrú Ama Oibre 1997 foráil do bhunshaoire íoctha de cheithre seachtainí in aghaidh na bliana, ach d'fhéadfadh cearta breise a bheith i gconradh an fhostaí

source: It is for your employer to decide when annual leave may be taken, but this is subject to a number of conditions
ga: Is faoin bhfostóir cinneadh a dhéanamh cén uair a thógfaidh fostaí saoire bhliantúil ach tá roinnt coinníollacha ag baint leis seo

source: Your employer must take into account your family responsibilities, opportunities for rest and recreation that are available to you and to consult with you (or your union) at least one month before the leave is to be taken
ga: Ní mór don bhfostóir dualgas clainne an fhostaí a thógáil san áireamh chomh maith le deiseanna scíthe a ligean agus siamsaíochta atá ar fáil duit agus ní mór dó/do dul i gcomhairle leat (nó le do cheardchumann) mí amháin ar a laghad roimh thús na saoire

source: In addition, annual leave should be taken within the appropriate leave year or with your consent, within 6 months of the relevant leave year
ga: Ina theannta sin, ba cheart saoire bhliantúil a thógáil laistigh den bhliain saoire chuí nó, le cead uait, laistigh de 6 mhí den bhliain saoire chuí

source: Further holding over (also known as carrying-over) of annual leave at your wish is a matter for agreement between you and your employer
ga: Is féidir leat teacht ar shocrú le d'fhostóir más mian leat saoire a choinneáil chuig bliain eile (saoire a thabhairt ar aghaidh a thugtar air sin chomh maith)

source: Holiday pay: Pay in respect of annual leave is paid in advance at the normal weekly rate
ga: Pá saoire: íoctar pá saoire roimh ré ag an ngnáthráta seachtainiúil

source: If your pay varies because, for example, of commission or bonus payments, your pay for your holidays is the average of your pay over the 13 weeks before you take holidays
ga: Má athraíonn do phá, mar shampla, de bharr íocaíochtaí coimisiúin nó bónas, is do phá saoire é meán do phá ar feadh 13 seachtain roimh thús do shaoire

source: Annual leave and sick leave
ga: Saoire bhliantúil agus saoire bhreoiteachta

source: If you are ill while you are on annual leave, you should get a medical certificate from your family doctor (GP) as soon as possible to cover the days that you were sick and give this to your employer as soon as you return to work
ga: Má tá tú breoite le linn saoire bliantúla, ba chóir duit teastas leighis a fháil ón dochtúir (LG) chomh luath agus is féidir chun na laethanta breoiteachta a chlúdach

source: In this way, the sick days will not count as annual leave and will be available to you at a later date
ga: Ba cheart an teastas seo a thabhairt don bhfostóir ar fhilleadh ar obair duit

source: An employer cannot require you to take annual leave for a certified period of illness
ga: Ní féidir le d'fhostóir iallach a chur ort saoire bhliantúil a thógáil i gcomhair tréimhse tinnis

source: Since 1 August 2015, you accumulate statutory annual leave entitlement during a period of certified sick leave
ga: Ó 1 Lúnasa 2015, is féidir teidlíocht saoire bliantúil reachtúil a fhabhrú i rith thréimhse shaoire bhreoiteachta teistithe

source: Employees on long-term sick leave can retain annual leave they could not take due to illness for up to 15 months after the end of the year in which it is accrued
ga: Is féidir oibrithe ar saoire bhreoiteachta fadtéarmach saoire bhliantúil nach féidir leo glacadh de bharr breoiteachta a choinnigh suas go 15 mhí i ndiaidh deireadh an bhliain ina bhfuil sé fabhraithe

source: Annual leave and other leave
ga: Saoire bhliantúil agus saoire eile

source: Annual leave is not affected by other leave provided for by law
ga: Ní chuireann saoire reachtúil isteach ar shaoire bhliantúil

source: Time spent on maternity leave, adoptive leave, parental leave, force majeure leave and the first 13 weeks of carer's leave is treated as though you have been in employment and this time can be used to accumulate annual leave entitlement - see 'Calculating annual leave' below
ga: Cuirtear san áireamh aon am caite ar shaoire mháithreachais, saoire uchtaíoch, saoire thuismitheora, saoire force majeure agus an chéad 13 seachtainí de shaoire cúramóra mar am caite i bhfostaíocht agus is féidir an t-am sin a chomhaireamh le cearta saoire bliantúla a ríomh – féach ‘Saoire bliaintúil a ríomh’ thíos

source: Annual leave and leaving employment
ga: Saoire bhliantúil agus fostaíocht a fhágáil

source: It is illegal under the Organisation of Working Time Act, 1997 for an employer to pay an allowance in lieu of the minimum statutory holiday entitlement of an employee unless the employment relationship is terminated
ga: Faoin Acht um Eagrú Ama 1997, tá sé mídhleathach má íocann fostóir liúntas in áit cheart íosmhéid saoire reachtúil an fhostaithe a íoc ach amháin nuair a chuirtear deireadh leis an bhfostaíocht

source: In general, your annual leave is calculated on the basis of hours worked
ga: Go ginearálta, ríomhtar do shaoire bhliantúil de réir na n-uaireanta atá oibrithe agat

source: If you are leaving a job you are entitled to receive payment for any outstanding annual leave and public holidays due to you
ga: Má tá tú ag fágáil fostaíochta, tá tú i dteideal íocaíochta i dtaobh saoire bliantúla agus laethanta saoire poiblí nár tógadh roimh dheireadh na fostaíochta

source: There are 3 different ways of calculating your annual leave entitlement:
ga: Tá 3 bhealach ann le saoire bhliantúil a ríomh:

source: • Based on the employee's working hours during what is called the leave year, which runs from April to March
ga: • Bunaithe ar uaireanta oibre an fhostaí le linn na tréimhse ar a dtugtar an bhliain saoire, a ritheann ón Aibreán go Márta

source: An employee who has worked at least 1,365 hours in a leave year is entitled to the maximum of 4 working weeks' paid annual leave unless it is a leave year in which they change employment
ga: Tá uasmhéid 4 seachtainí saoire ar fáil d'aon fhostaí a bhfuil ar a laghad 1,365 uair oibrithe aige/aici sa bhliain saoire mura gcríochnaíonn an fhostaíocht i rith na bliana saoire

source: Many employers use the calendar year (January-December) instead of the official leave year to calculate entitlement
ga: Baineann go leor fostóirí úsáid as an mbliain féilire (Eanáir-Nollaig) seachas an bhliain oifigiúil saoire a úsáid le cearta saoire a ríomh

source: • By allowing 1/3 of a working week for each calendar month in which the employee has worked at least 117 hours
ga: • 1/3 de sheachtain oibre a cheadú i leith gach mí ina bhfuil ar a laghad 117 uair déanta ag an bhfostaí

source: • 8% of the hours worked in the leave year, subject to a maximum of 4 working weeks
ga: • 8% de na huaireanta a d'oibrigh an fostaí sa bhliain saoire, suas le huasmhéid de cheithre seachtainí

source: An employee may use whichever of these methods gives the greater entitlement
ga: Is féidir le fostaí leas a bhaint as pé bealach a thugann an ceart is mó dó/di

source: When calculating the entitlement, employers should include all hours worked including time spent on annual leave, maternity leave, parental leave, force majeure leave, adoptive leave or the first 13 weeks of carer’s leave
ga: Nuair ríomhann an fostóir saoire bliantúil, ní mór don fhostóir gach uair oibrithe lena n-áirítear am caite ar shaoire bhliantúil, shaoire mháithreachais, saoire uchtaíoch, saoire tuismitheora, saoire force majeure agus an chéad 13 seachtain de shaoire cúramóra

source: An employee who has worked for at least 8 months is entitled to an unbroken period of 2 weeks' annual leave
ga: Tá fostaí a bhfuil ar a laghad 8 mí oibrithe aige/aici i dteideal tréimhse saoire coicíse a fháil in aon aonad amháin

source: Part-time work: Generally, the annual leave for part-time workers is calculated using the 3rd method, that is, 8% of hours worked
ga: Obair páirtaimseartha: Go ginearálta, tá an tsaoire bhliantúil d'fhostaithe páirtaimseartha ríofa tríd an 3ú bhealach, sin é, 8% de na huaireanta a d'oibrigh an fostaí

source: If you work full time for some months and the rest of the year you work part time, you should calculate the leave for the full-time and the part-time periods of work separately
ga: Má oibríonn tú go lánaimseartha ar feadh roinnt míosa agus má oibríonn tú go páirtaimseartha ar feadh a beidh fágtha den bhliain, ba chóir duit an tsaoire le haghaidh oibre lánaimseartha agus oibre páirtaimseartha a ríomh go leithleach

source: You can find out more about annual leave in this explanatory booklet on holidays and public holidays (pdf) or from the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Is féidir tuilleadh a léamh faoi shaoire bhliantúil sa leabhrán mínithe ar shaoire agus laethanta saoire phoiblí (pdf) nó ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are not getting your holiday entitlement you may make a complaint under the Organisation of Working Time Act 1997 within 6 months of the dispute or complaint occurring
ga: Mura bhfuil tú ag fáil do chearta saoire is féidir leat gearán a dhéanamh faoin Acht um Eagrú Ama Oibre 1997 laistigh de 6 mhí

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: The time limit may be extended for up to a further 6 months, but only where there is a reasonable cause which prevented the complaint being brought within the normal time limit. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama
